// Задача 2: Напишите программу, которая на вход принимает два числа 
// и выдаёт, какое число большее
// e.g. a = 2 b = 10 -> max = 10




// Задача 4: Напишите программу, которая принимает на вход три числа 
// и выдаёт максимальное из этих чисел.
// e.g. 44 5 78 -> 78



// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).
// e.g. 4 -> да        7 -> нет



// Задача 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.
// e.g. 8 -> 2, 4, 6, 8